/*
 * @Author: zhanghongqiao 
 * @Date: 2018-12-04 10:32:45 
 * @Email: 991034150@qq.com 
 * @Description: 网格信息
 * @Last Modified by: zhanghongqiao
 * @Last Modified time: 2019-04-12 18:05:46
 */
// const lng = [106.503536, 106.503581, 106.500515, 106.5065, 106.507978, 106.504586]
// const lat = [29.532552, 29.530042, 29.536918, 29.541863, 29.539263, 29.538715]
const lng = [104.16279353901746, 104.15285275474196, 116.59853215008974, 103.98262580707672, 103.89397047892214, 104.00244291007516, 104.05060464978214, 104.07795619055628, 104.09761057466267, 
    104.04044893607494, 104.16228406414388, 104.14305582001805, 104.11833212524652]
const lat = [30.624694329656975, 30.626227207250942, 35.46151654975964, 30.618147346122264, 30.837011363397714, 30.682205039432407, 
  30.61921233678585, 30.63595714300547, 30.66375152546262, 30.805334216684386, 30.778734474748422, 30.66194040473781,30.601993169664194]
const equipmentIds = ['0001', '0002', '0003', '0004', '0005', '0006']
const status = [0, 1, 0, 1, 1, 0, 1]
export default {
  url: '/integratedPlatform/findUserTaskData',
  // enableMock: true, // 是否使用本地假数据
  mock: {
    "erroCode":2000,
    "erroMsg":null,
    "result|11": [
      {
        "addr": "幸福区 安居街道",
        "imgUrl": "/static/images/face.png",
        "equipmentDTO": "设备数据",
        "equipmentId|+1": null,
        "fullName": "曾洪 1850123xxxx",
        "lat|+1": lat,
        "lng|+1": lng,
        // "lat": '35.506289',
        // "lng": '116.713157',
        "status|+1": status,
        "taskCode": "任务编号",
        "taskName": "任务名称",
        "timeSubsection": "操作时间记录",
        "userId": "用户id",
        "equipmentDTO": null
      }
    ]
  }
} 